# Problem 1

In [2]:
import pandas as pd
import numpy as np
import re

In [3]:
#EuroTYC = pd.read_csv("Euro 2012 stats TEAM.csv", usecols=['Team', 'Yellow Cards'])
#EuroTYC.columns = EuroTYC.columns.str.replace(' ','_')
EuroAll = pd.read_csv('Euro 2012 stats TEAM.csv')
EuroAll.columns = EuroAll.columns.str.replace(' ','_')
SA = pd.read_csv('Euro 2012 stats TEAM.csv')
SA.columns = EuroAll.columns.str.replace(' ','_')
#|EuroAll.head(3)

b) Find the team that has the best shooting accuracy.

In [4]:

SA.Shooting_Accuracy=SA.Shooting_Accuracy.map(lambda x: re.sub(r'[^\d.]+', '', x)).astype(float)
SA.loc[:,['Team','Shooting_Accuracy']].sort_values(by='Shooting_Accuracy',ascending=False)
#EuroAll.dtypes
#SA.groupby('Shooting_Accuracy',as_index=['Team'])['Team'].max()
SA=SA.query('Shooting_Accuracy>55')['Team']
print(f"the team that has the highest scooring accuracy is {SA.values[0]}")

#SA=EuroAll.replace('[^\d.]', '',regex=True).astype(float)
#re.sub(r'(((?<=\s)|^)[a-z])', lambda i: i.group().upper(), st)
#EuroAll.replace(to_replace=r'',value='',)
#Ask why I need to read the file again when I need to run the cell twice,
#first time do things ok, but second time is required to run the previous cell

the team that has the highest scooring accuracy is Spain

a) Find the teams that have lowest and highest number of yellow cards. Note that more than one
country can have the same maximum number or minimum number of yellow cards.

In [5]:
EuroAll=EuroAll[['Team','Yellow_Cards']].sort_values(by='Yellow_Cards',ascending=False)
maxYC=EuroAll.iloc[[0]].values[0][0]
print(f"Countries that have minimun number of Yellow cards:\n {maxYC}")
EuroAll=EuroAll[['Team','Yellow_Cards']].sort_values(by='Yellow_Cards',ascending=True)
minYC=EuroAll.iloc[[0,1]].values[:,0]
print(f"Countries that have maximun number of Yellow cards:\n {minYC[0]} \n {minYC[1]}")

Countries that have minimun number of Yellow cards:
 Italy
Countries that have maximun number of Yellow cards:
 Denmark
 Germany

In [6]:
#tyc=EuroAll.iloc[:,[0,-5]].sort_values(by='Yellow_Cards',ascending=False)
#tyc

In [6]:
#mtyc=tyc.iloc[0].values[0]
#wtyc=tyc.groupby('Yellow_Cards',as_index=['Team'], sort=False)[['Team']].min()
#wtyc

In [7]:
#EuroAll.iloc[:,0:10]


#Euro2cols = EuroAll.concat([tw,tr],axis=1,join='outer',keys=['Team', 'Yellow_Cards'])


#EuroAll.iloc[:,-5:-1])

#df.pivot_table(values='Yellow_Cards',index='Team',aggfunc=["max","min"])

# Problem 2

In [51]:
AS = pd.read_csv('AutoSurvey.csv')

In [52]:
print(AS.dtypes)
AS.head()
#AS.groupby(['Type','Purchased'],as_index=['Type','Purchased'])['Mileage'].mean()

Gender          object
Type            object
Purchased       object
Vehicle_Age    float64
Mileage          int64
MPG            float64
dtype: object

   Gender       Type Purchased  Vehicle_Age  Mileage   MPG
0    Male   Mid-size      Used         15.0   127233  28.7
1  Female   Mid-size       New          1.0    23970  43.4
2    Male      Small       New          7.0    77392  24.0
3  Female  Large SUV      Used         14.0   185397  15.2
4  Female      Small       New          2.0    26001  37.0

a) Print average mileage for each car type. Average of mileages should be grouped into columns
as New and Used, as shown below.

In [53]:
AS.pivot_table(values=['Mileage'],index='Type',columns="Purchased",aggfunc='mean',fill_value=0)

                 Mileage
Purchased            New      Used
Type
Large SUV  130905.000000  185397.0
Mid-size    11424.333333  106810.0
Minivan    180643.000000  182584.0
Small       80405.833333  131022.4
Small SUV   29823.000000  113121.0

b) For each car type find the difference between maximum and minimum Vehichle Age.

In [56]:
#AS=AS.groupby('Type')['Vehicle_Age'].agg(['max','min']).diff(axis=1)
AS.groupby('Type')[['Vehicle_Age']].apply(lambda x: x.max() - x.min())

           Vehicle_Age
Type
Large SUV         7.00
Mid-size         14.75
Minivan           5.00
Small            11.00
Small SUV        10.00